zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32p4-pinctrl.h
/**
 * @name I2S0_I_BCK
 * @{
 */
#define I2S0_I_BCK_GPIO0  ESP32_PINMUX(0, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO1  ESP32_PINMUX(1, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO2  ESP32_PINMUX(2, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO3  ESP32_PINMUX(3, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO4  ESP32_PINMUX(4, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO5  ESP32_PINMUX(5, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO6  ESP32_PINMUX(6, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO7  ESP32_PINMUX(7, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO8  ESP32_PINMUX(8, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO9  ESP32_PINMUX(9, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO10 ESP32_PINMUX(10, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO11 ESP32_PINMUX(11, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO12 ESP32_PINMUX(12, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO13 ESP32_PINMUX(13, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO14 ESP32_PINMUX(14, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO15 ESP32_PINMUX(15, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO16 ESP32_PINMUX(16, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO17 ESP32_PINMUX(17, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO18 ESP32_PINMUX(18, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO19 ESP32_PINMUX(19, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO20 ESP32_PINMUX(20, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO21 ESP32_PINMUX(21, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO22 ESP32_PINMUX(22, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO23 ESP32_PINMUX(23, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO24 ESP32_PINMUX(24, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO25 ESP32_PINMUX(25, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO26 ESP32_PINMUX(26, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO27 ESP32_PINMUX(27, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO28 ESP32_PINMUX(28, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO29 ESP32_PINMUX(29, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO30 ESP32_PINMUX(30, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO31 ESP32_PINMUX(31, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO32 ESP32_PINMUX(32, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO33 ESP32_PINMUX(33, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO34 ESP32_PINMUX(34, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO35 ESP32_PINMUX(35, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO36 ESP32_PINMUX(36, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO37 ESP32_PINMUX(37, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO38 ESP32_PINMUX(38, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO39 ESP32_PINMUX(39, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO40 ESP32_PINMUX(40, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO41 ESP32_PINMUX(41, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO42 ESP32_PINMUX(42, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO43 ESP32_PINMUX(43, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO44 ESP32_PINMUX(44, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO45 ESP32_PINMUX(45, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO46 ESP32_PINMUX(46, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO47 ESP32_PINMUX(47, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO48 ESP32_PINMUX(48, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO49 ESP32_PINMUX(49, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO50 ESP32_PINMUX(50, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO51 ESP32_PINMUX(51, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO52 ESP32_PINMUX(52, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO53 ESP32_PINMUX(53, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
#define I2S0_I_BCK_GPIO54 ESP32_PINMUX(54, ESP_I2S0_I_BCK_IN, ESP_I2S0_I_BCK_OUT)
/** @} */

/**
 * @name I2S0_I_SD
 * @{
 */
#define I2S0_I_SD_GPIO0  ESP32_PINMUX(0, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO1  ESP32_PINMUX(1, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO2  ESP32_PINMUX(2, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO3  ESP32_PINMUX(3, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO4  ESP32_PINMUX(4, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO5  ESP32_PINMUX(5, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO6  ESP32_PINMUX(6, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO7  ESP32_PINMUX(7, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO8  ESP32_PINMUX(8, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO9  ESP32_PINMUX(9, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO10 ESP32_PINMUX(10, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO11 ESP32_PINMUX(11, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO12 ESP32_PINMUX(12, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO13 ESP32_PINMUX(13, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO14 ESP32_PINMUX(14, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO15 ESP32_PINMUX(15, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO16 ESP32_PINMUX(16, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO17 ESP32_PINMUX(17, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO18 ESP32_PINMUX(18, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO19 ESP32_PINMUX(19, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO20 ESP32_PINMUX(20, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO21 ESP32_PINMUX(21, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO22 ESP32_PINMUX(22, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO23 ESP32_PINMUX(23, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO24 ESP32_PINMUX(24, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO25 ESP32_PINMUX(25, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO26 ESP32_PINMUX(26, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO27 ESP32_PINMUX(27, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO28 ESP32_PINMUX(28, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO29 ESP32_PINMUX(29, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO30 ESP32_PINMUX(30, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO31 ESP32_PINMUX(31, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO32 ESP32_PINMUX(32, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO33 ESP32_PINMUX(33, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO34 ESP32_PINMUX(34, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO35 ESP32_PINMUX(35, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO36 ESP32_PINMUX(36, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO37 ESP32_PINMUX(37, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO38 ESP32_PINMUX(38, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO39 ESP32_PINMUX(39, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO40 ESP32_PINMUX(40, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO41 ESP32_PINMUX(41, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO42 ESP32_PINMUX(42, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO43 ESP32_PINMUX(43, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO44 ESP32_PINMUX(44, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO45 ESP32_PINMUX(45, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO46 ESP32_PINMUX(46, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO47 ESP32_PINMUX(47, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO48 ESP32_PINMUX(48, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO49 ESP32_PINMUX(49, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO50 ESP32_PINMUX(50, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO51 ESP32_PINMUX(51, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO52 ESP32_PINMUX(52, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO53 ESP32_PINMUX(53, ESP_I2S0_I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO54 ESP32_PINMUX(54, ESP_I2S0_I_SD_IN, ESP_NOSIG)
/** @} */

/**
 * @name I2S0_I_WS
 * @{
 */
#define I2S0_I_WS_GPIO0  ESP32_PINMUX(0, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO1  ESP32_PINMUX(1, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO2  ESP32_PINMUX(2, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO3  ESP32_PINMUX(3, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO4  ESP32_PINMUX(4, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO5  ESP32_PINMUX(5, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO6  ESP32_PINMUX(6, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO7  ESP32_PINMUX(7, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO8  ESP32_PINMUX(8, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO9  ESP32_PINMUX(9, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO10 ESP32_PINMUX(10, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO11 ESP32_PINMUX(11, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO12 ESP32_PINMUX(12, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO13 ESP32_PINMUX(13, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO14 ESP32_PINMUX(14, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO15 ESP32_PINMUX(15, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO16 ESP32_PINMUX(16, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO17 ESP32_PINMUX(17, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO18 ESP32_PINMUX(18, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO19 ESP32_PINMUX(19, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO20 ESP32_PINMUX(20, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO21 ESP32_PINMUX(21, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO22 ESP32_PINMUX(22, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO23 ESP32_PINMUX(23, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO24 ESP32_PINMUX(24, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO25 ESP32_PINMUX(25, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO26 ESP32_PINMUX(26, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO27 ESP32_PINMUX(27, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO28 ESP32_PINMUX(28, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO29 ESP32_PINMUX(29, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO30 ESP32_PINMUX(30, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO31 ESP32_PINMUX(31, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO32 ESP32_PINMUX(32, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO33 ESP32_PINMUX(33, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO34 ESP32_PINMUX(34, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO35 ESP32_PINMUX(35, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO36 ESP32_PINMUX(36, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO37 ESP32_PINMUX(37, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO38 ESP32_PINMUX(38, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO39 ESP32_PINMUX(39, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO40 ESP32_PINMUX(40, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO41 ESP32_PINMUX(41, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO42 ESP32_PINMUX(42, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO43 ESP32_PINMUX(43, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO44 ESP32_PINMUX(44, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO45 ESP32_PINMUX(45, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO46 ESP32_PINMUX(46, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO47 ESP32_PINMUX(47, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO48 ESP32_PINMUX(48, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO49 ESP32_PINMUX(49, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO50 ESP32_PINMUX(50, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO51 ESP32_PINMUX(51, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO52 ESP32_PINMUX(52, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO53 ESP32_PINMUX(53, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
#define I2S0_I_WS_GPIO54 ESP32_PINMUX(54, ESP_I2S0_I_WS_IN, ESP_I2S0_I_WS_OUT)
/** @} */

/**
 * @name I2S0_MCLK
 * @{
 */
#define I2S0_MCLK_GPIO0  ESP32_PINMUX(0, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO1  ESP32_PINMUX(1, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO2  ESP32_PINMUX(2, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO3  ESP32_PINMUX(3, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO4  ESP32_PINMUX(4, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO5  ESP32_PINMUX(5, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO6  ESP32_PINMUX(6, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO7  ESP32_PINMUX(7, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO8  ESP32_PINMUX(8, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO9  ESP32_PINMUX(9, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO10 ESP32_PINMUX(10, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO11 ESP32_PINMUX(11, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO12 ESP32_PINMUX(12, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO13 ESP32_PINMUX(13, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO14 ESP32_PINMUX(14, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO15 ESP32_PINMUX(15, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO16 ESP32_PINMUX(16, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO17 ESP32_PINMUX(17, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO18 ESP32_PINMUX(18, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO19 ESP32_PINMUX(19, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO20 ESP32_PINMUX(20, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO21 ESP32_PINMUX(21, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO22 ESP32_PINMUX(22, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO23 ESP32_PINMUX(23, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO24 ESP32_PINMUX(24, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO25 ESP32_PINMUX(25, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO26 ESP32_PINMUX(26, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO27 ESP32_PINMUX(27, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO28 ESP32_PINMUX(28, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO29 ESP32_PINMUX(29, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO30 ESP32_PINMUX(30, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO31 ESP32_PINMUX(31, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO32 ESP32_PINMUX(32, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO33 ESP32_PINMUX(33, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO34 ESP32_PINMUX(34, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO35 ESP32_PINMUX(35, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO36 ESP32_PINMUX(36, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO37 ESP32_PINMUX(37, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO38 ESP32_PINMUX(38, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO39 ESP32_PINMUX(39, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO40 ESP32_PINMUX(40, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO41 ESP32_PINMUX(41, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO42 ESP32_PINMUX(42, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO43 ESP32_PINMUX(43, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO44 ESP32_PINMUX(44, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO45 ESP32_PINMUX(45, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO46 ESP32_PINMUX(46, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO47 ESP32_PINMUX(47, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO48 ESP32_PINMUX(48, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO49 ESP32_PINMUX(49, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO50 ESP32_PINMUX(50, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO51 ESP32_PINMUX(51, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO52 ESP32_PINMUX(52, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO53 ESP32_PINMUX(53, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
#define I2S0_MCLK_GPIO54 ESP32_PINMUX(54, ESP_I2S0_MCLK_IN, ESP_I2S0_MCLK_OUT)
/** @} */

/**
 * @name I2S0_O_BCK
 * @{
 */
#define I2S0_O_BCK_GPIO0  ESP32_PINMUX(0, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO1  ESP32_PINMUX(1, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO2  ESP32_PINMUX(2, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO3  ESP32_PINMUX(3, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO4  ESP32_PINMUX(4, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO5  ESP32_PINMUX(5, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO6  ESP32_PINMUX(6, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO7  ESP32_PINMUX(7, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO8  ESP32_PINMUX(8, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO9  ESP32_PINMUX(9, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO10 ESP32_PINMUX(10, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO11 ESP32_PINMUX(11, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO12 ESP32_PINMUX(12, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO13 ESP32_PINMUX(13, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO14 ESP32_PINMUX(14, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO15 ESP32_PINMUX(15, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO16 ESP32_PINMUX(16, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO17 ESP32_PINMUX(17, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO18 ESP32_PINMUX(18, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO19 ESP32_PINMUX(19, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO20 ESP32_PINMUX(20, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO21 ESP32_PINMUX(21, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO22 ESP32_PINMUX(22, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO23 ESP32_PINMUX(23, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO24 ESP32_PINMUX(24, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO25 ESP32_PINMUX(25, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO26 ESP32_PINMUX(26, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO27 ESP32_PINMUX(27, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO28 ESP32_PINMUX(28, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO29 ESP32_PINMUX(29, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO30 ESP32_PINMUX(30, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO31 ESP32_PINMUX(31, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO32 ESP32_PINMUX(32, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO33 ESP32_PINMUX(33, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO34 ESP32_PINMUX(34, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO35 ESP32_PINMUX(35, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO36 ESP32_PINMUX(36, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO37 ESP32_PINMUX(37, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO38 ESP32_PINMUX(38, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO39 ESP32_PINMUX(39, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO40 ESP32_PINMUX(40, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO41 ESP32_PINMUX(41, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO42 ESP32_PINMUX(42, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO43 ESP32_PINMUX(43, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO44 ESP32_PINMUX(44, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO45 ESP32_PINMUX(45, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO46 ESP32_PINMUX(46, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO47 ESP32_PINMUX(47, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO48 ESP32_PINMUX(48, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO49 ESP32_PINMUX(49, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO50 ESP32_PINMUX(50, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO51 ESP32_PINMUX(51, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO52 ESP32_PINMUX(52, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO53 ESP32_PINMUX(53, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
#define I2S0_O_BCK_GPIO54 ESP32_PINMUX(54, ESP_I2S0_O_BCK_IN, ESP_I2S0_O_BCK_OUT)
/** @} */

