zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32p4-pinctrl.h
/**
 * @name MCPWM0_OUT1A
 * @{
 */
#define MCPWM0_OUT1A_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO41 ESP32_PINMUX(41, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
#define MCPWM0_OUT1A_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_PWM0_CH1_A_OUT)
/** @} */

/**
 * @name MCPWM0_OUT1B
 * @{
 */
#define MCPWM0_OUT1B_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO41 ESP32_PINMUX(41, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
#define MCPWM0_OUT1B_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_PWM0_CH1_B_OUT)
/** @} */

/**
 * @name MCPWM0_OUT2A
 * @{
 */
#define MCPWM0_OUT2A_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO41 ESP32_PINMUX(41, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
#define MCPWM0_OUT2A_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_PWM0_CH2_A_OUT)
/** @} */

/**
 * @name MCPWM0_OUT2B
 * @{
 */
#define MCPWM0_OUT2B_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO41 ESP32_PINMUX(41, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
#define MCPWM0_OUT2B_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_PWM0_CH2_B_OUT)
/** @} */

/**
 * @name MCPWM0_SYNC0
 * @{
 */
#define MCPWM0_SYNC0_GPIO0  ESP32_PINMUX(0, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO1  ESP32_PINMUX(1, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO2  ESP32_PINMUX(2, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO3  ESP32_PINMUX(3, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO4  ESP32_PINMUX(4, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO5  ESP32_PINMUX(5, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO6  ESP32_PINMUX(6, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO7  ESP32_PINMUX(7, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO8  ESP32_PINMUX(8, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO9  ESP32_PINMUX(9, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO10 ESP32_PINMUX(10, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO11 ESP32_PINMUX(11, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO12 ESP32_PINMUX(12, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO13 ESP32_PINMUX(13, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO14 ESP32_PINMUX(14, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO15 ESP32_PINMUX(15, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO16 ESP32_PINMUX(16, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO17 ESP32_PINMUX(17, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO18 ESP32_PINMUX(18, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO19 ESP32_PINMUX(19, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO20 ESP32_PINMUX(20, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO21 ESP32_PINMUX(21, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO22 ESP32_PINMUX(22, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO23 ESP32_PINMUX(23, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO24 ESP32_PINMUX(24, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO25 ESP32_PINMUX(25, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO26 ESP32_PINMUX(26, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO27 ESP32_PINMUX(27, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO28 ESP32_PINMUX(28, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO29 ESP32_PINMUX(29, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO30 ESP32_PINMUX(30, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO31 ESP32_PINMUX(31, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO32 ESP32_PINMUX(32, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO33 ESP32_PINMUX(33, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO34 ESP32_PINMUX(34, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO35 ESP32_PINMUX(35, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO36 ESP32_PINMUX(36, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO37 ESP32_PINMUX(37, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO38 ESP32_PINMUX(38, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO39 ESP32_PINMUX(39, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO40 ESP32_PINMUX(40, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO41 ESP32_PINMUX(41, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO42 ESP32_PINMUX(42, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO43 ESP32_PINMUX(43, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO44 ESP32_PINMUX(44, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO45 ESP32_PINMUX(45, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO46 ESP32_PINMUX(46, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO47 ESP32_PINMUX(47, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO48 ESP32_PINMUX(48, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO49 ESP32_PINMUX(49, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO50 ESP32_PINMUX(50, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO51 ESP32_PINMUX(51, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO52 ESP32_PINMUX(52, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO53 ESP32_PINMUX(53, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
#define MCPWM0_SYNC0_GPIO54 ESP32_PINMUX(54, ESP_PWM0_SYNC0_IN, ESP_NOSIG)
/** @} */

