zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32p4-pinctrl.h
/**
 * @name PCNT3_CH0SIG
 * @{
 */
#define PCNT3_CH0SIG_GPIO0  ESP32_PINMUX(0, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO1  ESP32_PINMUX(1, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO2  ESP32_PINMUX(2, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO3  ESP32_PINMUX(3, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO4  ESP32_PINMUX(4, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO5  ESP32_PINMUX(5, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO6  ESP32_PINMUX(6, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO7  ESP32_PINMUX(7, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO8  ESP32_PINMUX(8, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO9  ESP32_PINMUX(9, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO10 ESP32_PINMUX(10, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO11 ESP32_PINMUX(11, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO12 ESP32_PINMUX(12, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO13 ESP32_PINMUX(13, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO14 ESP32_PINMUX(14, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO15 ESP32_PINMUX(15, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO16 ESP32_PINMUX(16, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO17 ESP32_PINMUX(17, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO18 ESP32_PINMUX(18, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO19 ESP32_PINMUX(19, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO20 ESP32_PINMUX(20, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO21 ESP32_PINMUX(21, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO22 ESP32_PINMUX(22, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO23 ESP32_PINMUX(23, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO24 ESP32_PINMUX(24, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO25 ESP32_PINMUX(25, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO26 ESP32_PINMUX(26, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO27 ESP32_PINMUX(27, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO28 ESP32_PINMUX(28, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO29 ESP32_PINMUX(29, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO30 ESP32_PINMUX(30, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO31 ESP32_PINMUX(31, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO32 ESP32_PINMUX(32, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO33 ESP32_PINMUX(33, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO34 ESP32_PINMUX(34, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO35 ESP32_PINMUX(35, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO36 ESP32_PINMUX(36, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO37 ESP32_PINMUX(37, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO38 ESP32_PINMUX(38, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO39 ESP32_PINMUX(39, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO40 ESP32_PINMUX(40, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO41 ESP32_PINMUX(41, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO42 ESP32_PINMUX(42, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO43 ESP32_PINMUX(43, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO44 ESP32_PINMUX(44, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO45 ESP32_PINMUX(45, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO46 ESP32_PINMUX(46, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO47 ESP32_PINMUX(47, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO48 ESP32_PINMUX(48, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO49 ESP32_PINMUX(49, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO50 ESP32_PINMUX(50, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO51 ESP32_PINMUX(51, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO52 ESP32_PINMUX(52, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO53 ESP32_PINMUX(53, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
#define PCNT3_CH0SIG_GPIO54 ESP32_PINMUX(54, ESP_PCNT_SIG_CH0_IN3, ESP_NOSIG)
/** @} */

/**
 * @name PCNT3_CH1CTRL
 * @{
 */
#define PCNT3_CH1CTRL_GPIO0  ESP32_PINMUX(0, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO1  ESP32_PINMUX(1, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO2  ESP32_PINMUX(2, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO3  ESP32_PINMUX(3, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO4  ESP32_PINMUX(4, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO5  ESP32_PINMUX(5, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO6  ESP32_PINMUX(6, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO7  ESP32_PINMUX(7, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO8  ESP32_PINMUX(8, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO9  ESP32_PINMUX(9, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO10 ESP32_PINMUX(10, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO11 ESP32_PINMUX(11, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO12 ESP32_PINMUX(12, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO13 ESP32_PINMUX(13, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO14 ESP32_PINMUX(14, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO15 ESP32_PINMUX(15, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO16 ESP32_PINMUX(16, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO17 ESP32_PINMUX(17, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO18 ESP32_PINMUX(18, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO19 ESP32_PINMUX(19, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO20 ESP32_PINMUX(20, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO21 ESP32_PINMUX(21, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO22 ESP32_PINMUX(22, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO23 ESP32_PINMUX(23, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO24 ESP32_PINMUX(24, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO25 ESP32_PINMUX(25, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO26 ESP32_PINMUX(26, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO27 ESP32_PINMUX(27, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO28 ESP32_PINMUX(28, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO29 ESP32_PINMUX(29, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO30 ESP32_PINMUX(30, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO31 ESP32_PINMUX(31, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO32 ESP32_PINMUX(32, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO33 ESP32_PINMUX(33, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO34 ESP32_PINMUX(34, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO35 ESP32_PINMUX(35, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO36 ESP32_PINMUX(36, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO37 ESP32_PINMUX(37, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO38 ESP32_PINMUX(38, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO39 ESP32_PINMUX(39, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO40 ESP32_PINMUX(40, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO41 ESP32_PINMUX(41, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO42 ESP32_PINMUX(42, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO43 ESP32_PINMUX(43, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO44 ESP32_PINMUX(44, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO45 ESP32_PINMUX(45, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO46 ESP32_PINMUX(46, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO47 ESP32_PINMUX(47, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO48 ESP32_PINMUX(48, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO49 ESP32_PINMUX(49, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO50 ESP32_PINMUX(50, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO51 ESP32_PINMUX(51, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO52 ESP32_PINMUX(52, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO53 ESP32_PINMUX(53, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO54 ESP32_PINMUX(54, ESP_PCNT_CTRL_CH1_IN3, ESP_NOSIG)
/** @} */

/**
 * @name PCNT3_CH1SIG
 * @{
 */
#define PCNT3_CH1SIG_GPIO0  ESP32_PINMUX(0, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO1  ESP32_PINMUX(1, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO2  ESP32_PINMUX(2, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO3  ESP32_PINMUX(3, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO4  ESP32_PINMUX(4, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO5  ESP32_PINMUX(5, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO6  ESP32_PINMUX(6, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO7  ESP32_PINMUX(7, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO8  ESP32_PINMUX(8, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO9  ESP32_PINMUX(9, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO10 ESP32_PINMUX(10, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO11 ESP32_PINMUX(11, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO12 ESP32_PINMUX(12, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO13 ESP32_PINMUX(13, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO14 ESP32_PINMUX(14, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO15 ESP32_PINMUX(15, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO16 ESP32_PINMUX(16, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO17 ESP32_PINMUX(17, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO18 ESP32_PINMUX(18, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO19 ESP32_PINMUX(19, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO20 ESP32_PINMUX(20, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO21 ESP32_PINMUX(21, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO22 ESP32_PINMUX(22, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO23 ESP32_PINMUX(23, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO24 ESP32_PINMUX(24, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO25 ESP32_PINMUX(25, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO26 ESP32_PINMUX(26, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO27 ESP32_PINMUX(27, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO28 ESP32_PINMUX(28, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO29 ESP32_PINMUX(29, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO30 ESP32_PINMUX(30, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO31 ESP32_PINMUX(31, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO32 ESP32_PINMUX(32, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO33 ESP32_PINMUX(33, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO34 ESP32_PINMUX(34, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO35 ESP32_PINMUX(35, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO36 ESP32_PINMUX(36, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO37 ESP32_PINMUX(37, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO38 ESP32_PINMUX(38, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO39 ESP32_PINMUX(39, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO40 ESP32_PINMUX(40, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO41 ESP32_PINMUX(41, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO42 ESP32_PINMUX(42, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO43 ESP32_PINMUX(43, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO44 ESP32_PINMUX(44, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO45 ESP32_PINMUX(45, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO46 ESP32_PINMUX(46, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO47 ESP32_PINMUX(47, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO48 ESP32_PINMUX(48, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO49 ESP32_PINMUX(49, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO50 ESP32_PINMUX(50, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO51 ESP32_PINMUX(51, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO52 ESP32_PINMUX(52, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO53 ESP32_PINMUX(53, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO54 ESP32_PINMUX(54, ESP_PCNT_SIG_CH1_IN3, ESP_NOSIG)
/** @} */

/**
 * @name RMII_CLK
 * @{
 */
#define RMII_CLK_GPIO32 ESP32_RMII_PINMUX(32, ESP_RMII_CLK)
#define RMII_CLK_GPIO44 ESP32_RMII_PINMUX(44, ESP_RMII_CLK)
#define RMII_CLK_GPIO50 ESP32_RMII_PINMUX(50, ESP_RMII_CLK)
/** @} */

/**
 * @name RMII_CRS_DV
 * @{
 */
#define RMII_CRS_DV_GPIO28 ESP32_RMII_PINMUX(28, ESP_RMII_CRS_DV)
#define RMII_CRS_DV_GPIO45 ESP32_RMII_PINMUX(45, ESP_RMII_CRS_DV)
#define RMII_CRS_DV_GPIO51 ESP32_RMII_PINMUX(51, ESP_RMII_CRS_DV)
/** @} */

/**
 * @name RMII_RXD0
 * @{
 */
#define RMII_RXD0_GPIO29 ESP32_RMII_PINMUX(29, ESP_RMII_RXD0)
#define RMII_RXD0_GPIO46 ESP32_RMII_PINMUX(46, ESP_RMII_RXD0)
#define RMII_RXD0_GPIO52 ESP32_RMII_PINMUX(52, ESP_RMII_RXD0)
/** @} */

/**
 * @name RMII_RXD1
 * @{
 */
#define RMII_RXD1_GPIO30 ESP32_RMII_PINMUX(30, ESP_RMII_RXD1)
#define RMII_RXD1_GPIO47 ESP32_RMII_PINMUX(47, ESP_RMII_RXD1)
#define RMII_RXD1_GPIO53 ESP32_RMII_PINMUX(53, ESP_RMII_RXD1)
/** @} */

/**
 * @name RMII_TX_EN
 * @{
 */
#define RMII_TX_EN_GPIO33 ESP32_RMII_PINMUX(33, ESP_RMII_TX_EN)
#define RMII_TX_EN_GPIO40 ESP32_RMII_PINMUX(40, ESP_RMII_TX_EN)
#define RMII_TX_EN_GPIO49 ESP32_RMII_PINMUX(49, ESP_RMII_TX_EN)
/** @} */

/**
 * @name RMII_TXD0
 * @{
 */
#define RMII_TXD0_GPIO34 ESP32_RMII_PINMUX(34, ESP_RMII_TXD0)
#define RMII_TXD0_GPIO41 ESP32_RMII_PINMUX(41, ESP_RMII_TXD0)
/** @} */

/**
 * @name RMII_TXD1
 * @{
 */
#define RMII_TXD1_GPIO35 ESP32_RMII_PINMUX(35, ESP_RMII_TXD1)
#define RMII_TXD1_GPIO42 ESP32_RMII_PINMUX(42, ESP_RMII_TXD1)
/** @} */

/**
 * @name SMI_MDC
 * @{
 */
#define SMI_MDC_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO41 ESP32_PINMUX(41, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_EMAC_MDC_O)
/** @} */

/**
 * @name SMI_MDIO
 * @{
 */
#define SMI_MDIO_GPIO0  ESP32_PINMUX(0, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO1  ESP32_PINMUX(1, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO2  ESP32_PINMUX(2, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO3  ESP32_PINMUX(3, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO4  ESP32_PINMUX(4, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO5  ESP32_PINMUX(5, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO6  ESP32_PINMUX(6, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO7  ESP32_PINMUX(7, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO8  ESP32_PINMUX(8, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO9  ESP32_PINMUX(9, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO10 ESP32_PINMUX(10, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO11 ESP32_PINMUX(11, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO12 ESP32_PINMUX(12, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO13 ESP32_PINMUX(13, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO14 ESP32_PINMUX(14, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO15 ESP32_PINMUX(15, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO16 ESP32_PINMUX(16, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO17 ESP32_PINMUX(17, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO18 ESP32_PINMUX(18, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO19 ESP32_PINMUX(19, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO20 ESP32_PINMUX(20, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO21 ESP32_PINMUX(21, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO22 ESP32_PINMUX(22, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO23 ESP32_PINMUX(23, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO24 ESP32_PINMUX(24, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO25 ESP32_PINMUX(25, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO26 ESP32_PINMUX(26, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO27 ESP32_PINMUX(27, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO28 ESP32_PINMUX(28, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO29 ESP32_PINMUX(29, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO30 ESP32_PINMUX(30, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO31 ESP32_PINMUX(31, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO32 ESP32_PINMUX(32, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO33 ESP32_PINMUX(33, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO34 ESP32_PINMUX(34, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO35 ESP32_PINMUX(35, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO36 ESP32_PINMUX(36, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO37 ESP32_PINMUX(37, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO38 ESP32_PINMUX(38, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO39 ESP32_PINMUX(39, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO40 ESP32_PINMUX(40, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO41 ESP32_PINMUX(41, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO42 ESP32_PINMUX(42, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO43 ESP32_PINMUX(43, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO44 ESP32_PINMUX(44, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO45 ESP32_PINMUX(45, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO46 ESP32_PINMUX(46, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO47 ESP32_PINMUX(47, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO48 ESP32_PINMUX(48, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO49 ESP32_PINMUX(49, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO50 ESP32_PINMUX(50, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO51 ESP32_PINMUX(51, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO52 ESP32_PINMUX(52, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO53 ESP32_PINMUX(53, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO54 ESP32_PINMUX(54, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
/** @} */

