zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32p4-pinctrl.h
/**
 * @name UART4_RX
 * @{
 */
#define UART4_RX_GPIO0  ESP32_PINMUX(0, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO1  ESP32_PINMUX(1, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO2  ESP32_PINMUX(2, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO3  ESP32_PINMUX(3, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO4  ESP32_PINMUX(4, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO5  ESP32_PINMUX(5, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO6  ESP32_PINMUX(6, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO7  ESP32_PINMUX(7, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO8  ESP32_PINMUX(8, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO9  ESP32_PINMUX(9, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO10 ESP32_PINMUX(10, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO11 ESP32_PINMUX(11, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO12 ESP32_PINMUX(12, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO13 ESP32_PINMUX(13, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO14 ESP32_PINMUX(14, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO15 ESP32_PINMUX(15, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO16 ESP32_PINMUX(16, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO17 ESP32_PINMUX(17, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO18 ESP32_PINMUX(18, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO19 ESP32_PINMUX(19, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO20 ESP32_PINMUX(20, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO21 ESP32_PINMUX(21, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO22 ESP32_PINMUX(22, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO23 ESP32_PINMUX(23, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO24 ESP32_PINMUX(24, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO25 ESP32_PINMUX(25, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO26 ESP32_PINMUX(26, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO27 ESP32_PINMUX(27, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO28 ESP32_PINMUX(28, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO29 ESP32_PINMUX(29, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO30 ESP32_PINMUX(30, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO31 ESP32_PINMUX(31, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO32 ESP32_PINMUX(32, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO33 ESP32_PINMUX(33, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO34 ESP32_PINMUX(34, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO35 ESP32_PINMUX(35, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO36 ESP32_PINMUX(36, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO37 ESP32_PINMUX(37, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO38 ESP32_PINMUX(38, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO39 ESP32_PINMUX(39, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO40 ESP32_PINMUX(40, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO41 ESP32_PINMUX(41, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO42 ESP32_PINMUX(42, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO43 ESP32_PINMUX(43, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO44 ESP32_PINMUX(44, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO45 ESP32_PINMUX(45, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO46 ESP32_PINMUX(46, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO47 ESP32_PINMUX(47, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO48 ESP32_PINMUX(48, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO49 ESP32_PINMUX(49, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO50 ESP32_PINMUX(50, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO51 ESP32_PINMUX(51, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO52 ESP32_PINMUX(52, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO53 ESP32_PINMUX(53, ESP_U4RXD_IN, ESP_NOSIG)
#define UART4_RX_GPIO54 ESP32_PINMUX(54, ESP_U4RXD_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART4_TX
 * @{
 */
#define UART4_TX_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO41 ESP32_PINMUX(41, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_U4TXD_OUT)
#define UART4_TX_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_U4TXD_OUT)
/** @} */

/**
 * @name SPIS2_CSEL
 * @{
 */
#define SPIS2_CSEL_GPIO0  ESP32_PINMUX(0, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO1  ESP32_PINMUX(1, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO2  ESP32_PINMUX(2, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO3  ESP32_PINMUX(3, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO4  ESP32_PINMUX(4, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO5  ESP32_PINMUX(5, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO6  ESP32_PINMUX(6, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO7  ESP32_PINMUX(7, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO8  ESP32_PINMUX(8, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO9  ESP32_PINMUX(9, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO10 ESP32_PINMUX(10, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO11 ESP32_PINMUX(11, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO12 ESP32_PINMUX(12, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO13 ESP32_PINMUX(13, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO14 ESP32_PINMUX(14, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO15 ESP32_PINMUX(15, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO16 ESP32_PINMUX(16, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO17 ESP32_PINMUX(17, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO18 ESP32_PINMUX(18, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO19 ESP32_PINMUX(19, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO20 ESP32_PINMUX(20, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO21 ESP32_PINMUX(21, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO22 ESP32_PINMUX(22, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO23 ESP32_PINMUX(23, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO24 ESP32_PINMUX(24, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO25 ESP32_PINMUX(25, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO26 ESP32_PINMUX(26, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO27 ESP32_PINMUX(27, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO28 ESP32_PINMUX(28, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO29 ESP32_PINMUX(29, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO30 ESP32_PINMUX(30, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO31 ESP32_PINMUX(31, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO32 ESP32_PINMUX(32, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO33 ESP32_PINMUX(33, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO34 ESP32_PINMUX(34, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO35 ESP32_PINMUX(35, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO36 ESP32_PINMUX(36, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO37 ESP32_PINMUX(37, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO38 ESP32_PINMUX(38, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO39 ESP32_PINMUX(39, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO40 ESP32_PINMUX(40, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO41 ESP32_PINMUX(41, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO42 ESP32_PINMUX(42, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO43 ESP32_PINMUX(43, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO44 ESP32_PINMUX(44, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO45 ESP32_PINMUX(45, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO46 ESP32_PINMUX(46, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO47 ESP32_PINMUX(47, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO48 ESP32_PINMUX(48, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO49 ESP32_PINMUX(49, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO50 ESP32_PINMUX(50, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO51 ESP32_PINMUX(51, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO52 ESP32_PINMUX(52, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO53 ESP32_PINMUX(53, ESP_FSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO54 ESP32_PINMUX(54, ESP_FSPICS0_IN, ESP_NOSIG)
/** @} */

/**
 * @name SPIS2_MISO
 * @{
 */
#define SPIS2_MISO_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO29 ESP32_PINMUX(29, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO41 ESP32_PINMUX(41, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_FSPIQ_OUT)
#define SPIS2_MISO_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_FSPIQ_OUT)
/** @} */

/**
 * @name SPIS2_MOSI
 * @{
 */
#define SPIS2_MOSI_GPIO0  ESP32_PINMUX(0, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO1  ESP32_PINMUX(1, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO2  ESP32_PINMUX(2, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO3  ESP32_PINMUX(3, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO4  ESP32_PINMUX(4, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO5  ESP32_PINMUX(5, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO6  ESP32_PINMUX(6, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO7  ESP32_PINMUX(7, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO8  ESP32_PINMUX(8, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO9  ESP32_PINMUX(9, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO10 ESP32_PINMUX(10, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO11 ESP32_PINMUX(11, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO12 ESP32_PINMUX(12, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO13 ESP32_PINMUX(13, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO14 ESP32_PINMUX(14, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO15 ESP32_PINMUX(15, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO16 ESP32_PINMUX(16, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO17 ESP32_PINMUX(17, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO18 ESP32_PINMUX(18, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO19 ESP32_PINMUX(19, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO20 ESP32_PINMUX(20, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO21 ESP32_PINMUX(21, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO22 ESP32_PINMUX(22, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO23 ESP32_PINMUX(23, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO24 ESP32_PINMUX(24, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO25 ESP32_PINMUX(25, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO26 ESP32_PINMUX(26, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO27 ESP32_PINMUX(27, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO28 ESP32_PINMUX(28, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO29 ESP32_PINMUX(29, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO30 ESP32_PINMUX(30, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO31 ESP32_PINMUX(31, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO32 ESP32_PINMUX(32, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO33 ESP32_PINMUX(33, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO34 ESP32_PINMUX(34, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO35 ESP32_PINMUX(35, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO36 ESP32_PINMUX(36, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO37 ESP32_PINMUX(37, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO38 ESP32_PINMUX(38, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO39 ESP32_PINMUX(39, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO40 ESP32_PINMUX(40, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO41 ESP32_PINMUX(41, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO42 ESP32_PINMUX(42, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO43 ESP32_PINMUX(43, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO44 ESP32_PINMUX(44, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO45 ESP32_PINMUX(45, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO46 ESP32_PINMUX(46, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO47 ESP32_PINMUX(47, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO48 ESP32_PINMUX(48, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO49 ESP32_PINMUX(49, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO50 ESP32_PINMUX(50, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO51 ESP32_PINMUX(51, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO52 ESP32_PINMUX(52, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO53 ESP32_PINMUX(53, ESP_FSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO54 ESP32_PINMUX(54, ESP_FSPID_IN, ESP_NOSIG)
/** @} */

/**
 * @name SPIS2_SCLK
 * @{
 */
#define SPIS2_SCLK_GPIO0  ESP32_PINMUX(0, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO1  ESP32_PINMUX(1, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO2  ESP32_PINMUX(2, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO3  ESP32_PINMUX(3, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO4  ESP32_PINMUX(4, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO5  ESP32_PINMUX(5, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO6  ESP32_PINMUX(6, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO7  ESP32_PINMUX(7, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO8  ESP32_PINMUX(8, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO9  ESP32_PINMUX(9, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO10 ESP32_PINMUX(10, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO11 ESP32_PINMUX(11, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO12 ESP32_PINMUX(12, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO13 ESP32_PINMUX(13, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO14 ESP32_PINMUX(14, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO15 ESP32_PINMUX(15, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO16 ESP32_PINMUX(16, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO17 ESP32_PINMUX(17, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO18 ESP32_PINMUX(18, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO19 ESP32_PINMUX(19, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO20 ESP32_PINMUX(20, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO21 ESP32_PINMUX(21, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO22 ESP32_PINMUX(22, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO23 ESP32_PINMUX(23, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO24 ESP32_PINMUX(24, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO25 ESP32_PINMUX(25, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO26 ESP32_PINMUX(26, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO27 ESP32_PINMUX(27, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO28 ESP32_PINMUX(28, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO29 ESP32_PINMUX(29, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO30 ESP32_PINMUX(30, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO31 ESP32_PINMUX(31, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO32 ESP32_PINMUX(32, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO33 ESP32_PINMUX(33, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO34 ESP32_PINMUX(34, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO35 ESP32_PINMUX(35, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO36 ESP32_PINMUX(36, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO37 ESP32_PINMUX(37, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO38 ESP32_PINMUX(38, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO39 ESP32_PINMUX(39, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO40 ESP32_PINMUX(40, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO41 ESP32_PINMUX(41, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO42 ESP32_PINMUX(42, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO43 ESP32_PINMUX(43, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO44 ESP32_PINMUX(44, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO45 ESP32_PINMUX(45, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO46 ESP32_PINMUX(46, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO47 ESP32_PINMUX(47, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO48 ESP32_PINMUX(48, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO49 ESP32_PINMUX(49, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO50 ESP32_PINMUX(50, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO51 ESP32_PINMUX(51, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO52 ESP32_PINMUX(52, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO53 ESP32_PINMUX(53, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO54 ESP32_PINMUX(54, ESP_FSPICLK_IN, ESP_NOSIG)
/** @} */

